{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no methods defined.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Buy Now button, checkout flow, showroom display, showroom data storage) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and key implementation details.",
  "frontend/index.css": "Global CSS file defining Tailwind base/components/utilities and OKLCH-based CSS custom property tokens for light and dark themes including background, foreground, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point with the page title set to 'HOOD' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with a root route, an index route rendering HomePage (with all sections), and a /models route rendering ModelsPage.",
  "frontend/src/components/carousel/HeroCarousel.tsx": "Full-viewport hero carousel with three slides (two futuristic car image slides and one promotional text slide), auto-advancing every 5 seconds with navigation arrows and dot indicators.",
  "frontend/src/components/checkout/CheckoutFlow.tsx": "Multi-step checkout flow component managing state across payment type selection, optional EMI plan, payment details, and success confirmation steps, with luxury and standard styling variants.",
  "frontend/src/components/checkout/CheckoutModal.tsx": "A modal dialog component for the car checkout process that displays a two-column layout with the checkout flow on the left and a showroom panel with car thumbnail on the right, with distinct styling for luxury vs standard car categories.",
  "frontend/src/components/checkout/CheckoutSuccess.tsx": "A success confirmation screen shown after a completed purchase, displaying an order summary (order ID, vehicle, payment type, EMI details, amount paid) with separate luxury and standard visual styles.",
  "frontend/src/components/checkout/EMIPlanStep.tsx": "A checkout step component that lets users select an EMI tenure (6, 12, or 24 months) and displays the calculated monthly payment for each option, with luxury and standard UI variants.",
  "frontend/src/components/checkout/PaymentDetailsStep.tsx": "A checkout step that collects payment information via card or UPI, includes client-side validation, simulates a 2-second processing delay, and supports luxury and standard styling modes.",
  "frontend/src/components/checkout/PaymentTypeStep.tsx": "A checkout step allowing users to choose between full payment or a refundable booking amount deposit, with selectable option cards styled for both luxury and standard themes.",
  "frontend/src/components/checkout/ShowroomPanel.tsx": "A sidebar panel that displays the nearest showroom's name, address, and phone number, rendered with ornamental luxury styling or a standard card style depending on the car category.",
  "frontend/src/components/contact/ContactForm.tsx": "A contact form component with name, email, and message fields, including client-side validation, simulated async submission, and a success confirmation view.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand blurb, smooth-scroll navigation links, social media icons, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky site header with desktop navigation, a 'Book Test Drive' CTA button, and a mobile slide-out sheet menu; handles smooth scrolling and TanStack Router navigation.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wrapper layout component that composes the Header, main content area, and Footer into a full-page dark-themed flex column.",
  "frontend/src/components/models/CarModelCard.tsx": "Displays a single car model card with image, specs, and INR pricing (including GST); renders a distinct luxury gold-accented style for Luxury category cars and opens a CheckoutModal on purchase.",
  "frontend/src/components/models/CategoryTabs.tsx": "Sticky tab bar for the models page that highlights the active category (Vintage, Sports, Luxury) using IntersectionObserver and scrolls to the corresponding section on click.",
  "frontend/src/components/sections/AboutSection.tsx": "About section displaying HOOD's mission, values with icons, and a 2×2 grid of company stats (vehicles delivered, satisfaction rate, countries, electric commitment).",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with email, phone, and address info alongside showroom hours and an embedded ContactForm component.",
  "frontend/src/components/sections/HomeHero.tsx": "Hero section with a full-bleed background image, tagline, and two CTA buttons that smooth-scroll to the models and contact sections.",
  "frontend/src/components/sections/ModelsSection.tsx": "Displays a grid of car model cards sourced from the models content file, each showing an image, badge, description, and spec list.",
  "frontend/src/components/sections/TechnologySection.tsx": "Renders a four-card grid highlighting key technology features (electric performance, safety, connectivity, engineering) with icons and descriptions.",
  "frontend/src/content/carModels.ts": "Defines the CarModel type and exports a large array of car models across Vintage, Sports, and Luxury categories with specs, pricing in INR, and image paths.",
  "frontend/src/content/models.ts": "Defines the Model and ModelSpec types and exports three flagship HOOD car models (Apex GT, Sport, Luxury) with specs for use in the ModelsSection.",
  "frontend/src/content/showrooms.ts": "Defines the Showroom type and exports a record mapping each car model ID to its corresponding HOOD showroom location across Indian cities.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file; no backend methods exist since all data is static and managed client-side.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind layers and the Cormorant Garamond font, defining CSS custom properties for light/dark themes including a luxury gold token set.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/ModelsPage.tsx": "Page component rendering car model sections (vintage, sports, luxury) with category tabs and CarModelCard grids; the luxury section uses a distinct dark gold-accented layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with Inter/Cormorant Garamond fonts, oklch-based color tokens (primary, accent, luxury gold, sidebar, charts), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (v3) describing the luxury car showcase app's existing features (Buy Now checkout flow, EMI plans, showroom data) and pending feature requests for the build planner."
}