{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented methods.",
  "feature_evidence.json": "Feature evidence report confirming the HeroCarousel component was expanded to full viewport dimensions (100vw × 100vh) with high confidence.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions summarizing each component's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, accent, and sidebar tokens.",
  "frontend/index.html": "HTML entry point setting the document title to 'HOOD' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that composes HeroCarousel, HomeHero, and all page sections inside the SiteLayout wrapper.",
  "frontend/src/components/carousel/HeroCarousel.tsx": "Full-viewport (w-screen h-screen) auto-rotating carousel with three slides—two futuristic car image slides and one promotional text slide—featuring navigation arrows, dot indicators, and 5-second auto-advance.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with name, email, and message fields, client-side validation, simulated async submission, loading states, and a success confirmation view.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with HOOD text branding, quick-nav links, social media icons, copyright, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Sticky responsive header with HOOD wordmark, desktop navigation, a 'Book Test Drive' CTA button, and a mobile sheet menu; all interactive elements styled in the accent (red) color.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper that enforces the dark theme class and arranges Header, main content area, and Footer in a full-height flex column.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the 'About' page section with company mission/values (icons + text) and a 2x2 grid of key statistics like vehicles delivered and customer satisfaction.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders the 'Contact' section displaying contact info (email, phone, address, showroom hours) alongside the ContactForm component.",
  "frontend/src/components/sections/HomeHero.tsx": "Renders the hero section with a full-bleed background image, headline, tagline, and buttons that smooth-scroll to the models and contact sections.",
  "frontend/src/components/sections/ModelsSection.tsx": "Renders a grid of vehicle model cards sourced from the models content file, each showing an image, badge, description, and spec list.",
  "frontend/src/components/sections/TechnologySection.tsx": "Renders a 2x2 grid of technology feature cards (Electric Performance, Safety, Connectivity, Engineering) with icons and descriptions.",
  "frontend/src/content/models.ts": "Defines TypeScript interfaces and static data for three car models (Apex GT, Sport, Luxury) including specs, images, and badges.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file with no exports, noting that the backend has no callable methods and all data is static.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties (design tokens) for light and dark themes using OKLCH color values, including colors for background, foreground, primary, sidebar, and chart variables.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider (React Query) and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with OKLCH-based CSS variable color mappings, custom border radius, box shadows, font families, and registers plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking the app named 'HOOD' (a futuristic car carousel), its existing features, and a pending feature request to expand the HeroCarousel to full viewport dimensions (100vw × 100vh)."
}